# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd 
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
first=pd.Series(np.random.randint(1,5,size=100))
second=pd.Series(np.random.randint(1,4,size=100))
third=pd.Series(np.random.randint(10000,30000,size=100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [3]:
df = pd.concat([first,second,third],axis=1)
df

    0  1      2
0   1  2  11361
1   2  1  14130
2   1  3  29586
3   2  1  10933
4   2  2  23633
.. .. ..    ...
95  4  3  29006
96  1  1  21522
97  2  1  17161
98  4  2  16894
99  2  1  21374

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [4]:
df.columns=["bedrs","bathrs","price_sqr_meter"]
df

    bedrs  bathrs  price_sqr_meter
0       1       2            11361
1       2       1            14130
2       1       3            29586
3       2       1            10933
4       2       2            23633
..    ...     ...              ...
95      4       3            29006
96      1       1            21522
97      2       1            17161
98      4       2            16894
99      2       1            21374

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [5]:
bigcolumn = pd.concat([first, second, third], axis=1)
bigcolumn

    0  1      2
0   1  2  11361
1   2  1  14130
2   1  3  29586
3   2  1  10933
4   2  2  23633
.. .. ..    ...
95  4  3  29006
96  1  1  21522
97  2  1  17161
98  4  2  16894
99  2  1  21374

[100 rows x 3 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [8]:
bigcolumn = pd.concat([first, second, third], axis=0).reset_index(drop=True)
bigcolumn

0          1
1          2
2          1
3          2
4          2
       ...
295    29006
296    21522
297    17161
298    16894
299    21374
Length: 300, dtype: int32